Parker4091/rs_cmake_stm32/ThirdParty/stm32_hal/mock/mock_stm32_hal_driver.h
    // Timer Extended
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_Init, ( TIM_HandleTypeDef * htim, const TIM_HallSensor_InitTypeDef *sConfig ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_DeInit, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( void, HAL_TIMEx_HallSensor_MspInit, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( void, HAL_TIMEx_HallSensor_MspDeInit, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_Start, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_Stop, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_Start_IT, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_Stop_IT, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_Start_DMA, ( TIM_HandleTypeDef * htim, uint32_t *pData, uint16_t Length ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_HallSensor_Stop_DMA, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OCN_Start, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OCN_Stop, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OCN_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OCN_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OCN_Start_DMA,
                       ( TIM_HandleTypeDef * htim, uint32_t Channel, const uint32_t *pData, uint16_t Length ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OCN_Stop_DMA, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_PWMN_Start, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_PWMN_Stop, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_PWMN_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_PWMN_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_PWMN_Start_DMA,
                       ( TIM_HandleTypeDef * htim, uint32_t Channel, const uint32_t *pData, uint16_t Length ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_PWMN_Stop_DMA, ( TIM_HandleTypeDef * htim, uint32_t Channel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OnePulseN_Start, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OnePulseN_Stop, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OnePulseN_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_OnePulseN_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_ConfigCommutEvent,
                       ( TIM_HandleTypeDef * htim, uint32_t InputTrigger, uint32_t CommutationSource ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_ConfigCommutEvent_IT,
                       ( TIM_HandleTypeDef * htim, uint32_t InputTrigger, uint32_t CommutationSource ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_ConfigCommutEvent_DMA,
                       ( TIM_HandleTypeDef * htim, uint32_t InputTrigger, uint32_t CommutationSource ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_MasterConfigSynchronization,
                       ( TIM_HandleTypeDef * htim, const TIM_MasterConfigTypeDef *sMasterConfig ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_ConfigBreakDeadTime,
                       ( TIM_HandleTypeDef * htim, const TIM_BreakDeadTimeConfigTypeDef *sBreakDeadTimeConfig ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_ConfigBreakInput,
                       ( TIM_HandleTypeDef * htim, uint32_t BreakInput, const TIMEx_BreakInputConfigTypeDef *sBreakInputConfig ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_GroupChannel5, ( TIM_HandleTypeDef * htim, uint32_t Channels ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_TIMEx_RemapConfig, ( TIM_HandleTypeDef * htim, uint32_t Remap ) )
    CMOCK_MOCK_METHOD( void, HAL_TIMEx_CommutCallback, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( void, HAL_TIMEx_CommutHalfCpltCallback, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( void, HAL_TIMEx_BreakCallback, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( void, HAL_TIMEx_Break2Callback, ( TIM_HandleTypeDef * htim ) )
    CMOCK_MOCK_METHOD( HAL_TIM_StateTypeDef, HAL_TIMEx_HallSensor_GetState, ( const TIM_HandleTypeDef *htim ) )
    CMOCK_MOCK_METHOD( HAL_TIM_ChannelStateTypeDef, HAL_TIMEx_GetChannelNState, ( const TIM_HandleTypeDef *htim, uint32_t ChannelN ) )
    CMOCK_MOCK_METHOD( void, TIMEx_DMACommutationCplt, ( DMA_HandleTypeDef * hdma ) )
    CMOCK_MOCK_METHOD( void, TIMEx_DMACommutationHalfCplt, ( DMA_HandleTypeDef * hdma ) )

    // HAL Cortex
    CMOCK_MOCK_METHOD( void, HAL_NVIC_SetPriorityGrouping, ( uint32_t PriorityGroup ) )
    CMOCK_MOCK_METHOD( void, HAL_NVIC_SetPriority, ( IRQn_Type IRQn, uint32_t PreemptPriority, uint32_t SubPriority ) )
    CMOCK_MOCK_METHOD( void, HAL_NVIC_EnableIRQ, ( IRQn_Type IRQn ) )
    CMOCK_MOCK_METHOD( void, HAL_NVIC_DisableIRQ, ( IRQn_Type IRQn ) )
    CMOCK_MOCK_METHOD( void, HAL_NVIC_SystemReset, () )
    CMOCK_MOCK_METHOD( uint32_t, HAL_SYSTICK_Config, ( uint32_t TicksNumb ) )
    CMOCK_MOCK_METHOD( uint32_t, HAL_NVIC_GetPriorityGrouping, () )
    CMOCK_MOCK_METHOD( void, HAL_NVIC_GetPriority, ( IRQn_Type IRQn, uint32_t PriorityGroup, uint32_t *pPreemptPriority, uint32_t *pSubPriority ) )
    CMOCK_MOCK_METHOD( uint32_t, HAL_NVIC_GetPendingIRQ, ( IRQn_Type IRQn ) )
    CMOCK_MOCK_METHOD( void, HAL_NVIC_SetPendingIRQ, ( IRQn_Type IRQn ) )
    CMOCK_MOCK_METHOD( void, HAL_NVIC_ClearPendingIRQ, ( IRQn_Type IRQn ) )
    CMOCK_MOCK_METHOD( uint32_t, HAL_NVIC_GetActive, ( IRQn_Type IRQn ) )
    CMOCK_MOCK_METHOD( void, HAL_SYSTICK_CLKSourceConfig, ( uint32_t CLKSource ) )
    CMOCK_MOCK_METHOD( void, HAL_SYSTICK_IRQHandler, () )
    CMOCK_MOCK_METHOD( void, HAL_SYSTICK_Callback, () )

#if( __MPU_PRESENT == 1 )
    CMOCK_MOCK_METHOD( void, HAL_MPU_Enable, ( uint32_t MPU_Control ) )
    CMOCK_MOCK_METHOD( void, HAL_MPU_Disable, () )
    CMOCK_MOCK_METHOD( void, HAL_MPU_ConfigRegion, ( MPU_Region_InitTypeDef * MPU_Init ) )
#endif /* __MPU_PRESENT */

    // I2C
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Init, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_DeInit, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_MspInit, ( I2C_HandleTypeDef * hi2c ) )
//    CMOCK_MOCK_METHOD(void, HAL_I2C_MspDeInit,(I2C_HandleTypeDef *hi2c))  // TODO(??): Why is there multiple instances of this definition?
#if( USE_HAL_I2C_REGISTER_CALLBACKS == 1 )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_RegisterCallback,
                       ( I2C_HandleTypeDef * hi2c, HAL_I2C_CallbackIDTypeDef CallbackID, pI2C_CallbackTypeDef pCallback ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_UnRegisterCallback, ( I2C_HandleTypeDef * hi2c, HAL_I2C_CallbackIDTypeDef CallbackID ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_RegisterAddrCallback, ( I2C_HandleTypeDef * hi2c, pI2C_AddrCallbackTypeDef pCallback ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_UnRegisterAddrCallback, ( I2C_HandleTypeDef * hi2c ) )
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Transmit,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Receive,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Transmit, ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Receive, ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Mem_Write,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size,
                         uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Mem_Read,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size,
                         uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_IsDeviceReady,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint32_t Trials, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Transmit_IT,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Receive_IT,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Transmit_IT, ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Receive_IT, ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Mem_Write_IT,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Mem_Read_IT,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Seq_Transmit_IT,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Seq_Receive_IT,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Seq_Transmit_IT,
                       ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Seq_Receive_IT,
                       ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_EnableListen_IT, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_DisableListen_IT, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Abort_IT, ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Transmit_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Receive_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Transmit_DMA, ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Receive_DMA, ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Mem_Write_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Mem_Read_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Seq_Transmit_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Master_Seq_Receive_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint16_t DevAddress, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Seq_Transmit_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2C_Slave_Seq_Receive_DMA,
                       ( I2C_HandleTypeDef * hi2c, uint8_t *pData, uint16_t Size, uint32_t XferOptions ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_EV_IRQHandler, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_ER_IRQHandler, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_MasterTxCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_MasterRxCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_SlaveTxCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_SlaveRxCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_AddrCallback, ( I2C_HandleTypeDef * hi2c, uint8_t TransferDirection, uint16_t AddrMatchCode ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_ListenCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_MemTxCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_MemRxCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_ErrorCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2C_AbortCpltCallback, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( HAL_I2C_StateTypeDef, HAL_I2C_GetState, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( HAL_I2C_ModeTypeDef, HAL_I2C_GetMode, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( uint32_t, HAL_I2C_GetError, ( I2C_HandleTypeDef * hi2c ) )

    // I2c Extended
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2CEx_ConfigAnalogFilter, ( I2C_HandleTypeDef * hi2c, uint32_t AnalogFilter ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2CEx_ConfigDigitalFilter, ( I2C_HandleTypeDef * hi2c, uint32_t DigitalFilter ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2CEx_EnableWakeUp, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_I2CEx_DisableWakeUp, ( I2C_HandleTypeDef * hi2c ) )
    CMOCK_MOCK_METHOD( void, HAL_I2CEx_EnableFastModePlus, ( uint32_t ConfigFastModePlus ) )
    CMOCK_MOCK_METHOD( void, HAL_I2CEx_DisableFastModePlus, ( uint32_t ConfigFastModePlus ) )

    // DMA
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_Init, ( DMA_HandleTypeDef * hdma ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_DeInit, ( DMA_HandleTypeDef * hdma ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_Start, ( DMA_HandleTypeDef * hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_Start_IT,
                       ( DMA_HandleTypeDef * hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_Abort, ( DMA_HandleTypeDef * hdma ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_Abort_IT, ( DMA_HandleTypeDef * hdma ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_PollForTransfer,
                       ( DMA_HandleTypeDef * hdma, HAL_DMA_LevelCompleteTypeDef CompleteLevel, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( void, HAL_DMA_IRQHandler, ( DMA_HandleTypeDef * hdma ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_RegisterCallback,
                       ( DMA_HandleTypeDef * hdma, HAL_DMA_CallbackIDTypeDef CallbackID, void ( *pCallback )( DMA_HandleTypeDef *_hdma ) ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_DMA_UnRegisterCallback, ( DMA_HandleTypeDef * hdma, HAL_DMA_CallbackIDTypeDef CallbackID ) )
    CMOCK_MOCK_METHOD( HAL_DMA_StateTypeDef, HAL_DMA_GetState, ( DMA_HandleTypeDef * hdma ) )
    CMOCK_MOCK_METHOD( uint32_t, HAL_DMA_GetError, ( DMA_HandleTypeDef * hdma ) )

    // SPI
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Init, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_DeInit, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( void, HAL_SPI_MspInit, ( SPI_HandleTypeDef * hspi ) )
//    CMOCK_MOCK_METHOD(void, HAL_SPI_MspDeInit,(SPI_HandleTypeDef *hspi)) // TODO(??): Why is there multiple instances of this definition?
#if( USE_HAL_SPI_REGISTER_CALLBACKS == 1U )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_RegisterCallback,
                       ( SPI_HandleTypeDef * hspi, HAL_SPI_CallbackIDTypeDef CallbackID, pSPI_CallbackTypeDef pCallback ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_UnRegisterCallback, ( SPI_HandleTypeDef * hspi, HAL_SPI_CallbackIDTypeDef CallbackID ) )
#endif /* USE_HAL_SPI_REGISTER_CALLBACKS */
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Transmit, ( SPI_HandleTypeDef * hspi, uint8_t *pData, uint16_t Size, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Receive, ( SPI_HandleTypeDef * hspi, uint8_t *pData, uint16_t Size, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_TransmitReceive,
                       ( SPI_HandleTypeDef * hspi, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Transmit_IT, ( SPI_HandleTypeDef * hspi, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Receive_IT, ( SPI_HandleTypeDef * hspi, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_TransmitReceive_IT,
                       ( SPI_HandleTypeDef * hspi, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Transmit_DMA, ( SPI_HandleTypeDef * hspi, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Receive_DMA, ( SPI_HandleTypeDef * hspi, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_TransmitReceive_DMA,
                       ( SPI_HandleTypeDef * hspi, uint8_t *pTxData, uint8_t *pRxData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_DMAPause, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_DMAResume, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_DMAStop, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Abort, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_SPI_Abort_IT, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( void, HAL_SPI_IRQHandler, ( SPI_HandleTypeDef * hspi ) )
    // CMOCK_MOCK_METHOD(void, HAL_SPI_TxCpltCallback,(SPI_HandleTypeDef *hspi))  // TODO(??): Why is there multiple instances of this definition?
    // CMOCK_MOCK_METHOD(void, HAL_SPI_RxCpltCallback,(SPI_HandleTypeDef *hspi))  // TODO(??): Why is there multiple instances of this definition?
    CMOCK_MOCK_METHOD( void, HAL_SPI_TxRxCpltCallback, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( void, HAL_SPI_TxHalfCpltCallback, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( void, HAL_SPI_RxHalfCpltCallback, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( void, HAL_SPI_TxRxHalfCpltCallback, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( void, HAL_SPI_ErrorCallback, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( void, HAL_SPI_AbortCpltCallback, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( HAL_SPI_StateTypeDef, HAL_SPI_GetState, ( SPI_HandleTypeDef * hspi ) )
    CMOCK_MOCK_METHOD( uint32_t, HAL_SPI_GetError, ( SPI_HandleTypeDef * hspi ) )

