Parker4091/rs_cmake_stm32/ThirdParty/stm32_hal/mock/mock_stm32_hal_driver.h
    // UART Extended
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_RS485Ex_Init,
                       ( UART_HandleTypeDef * huart, uint32_t Polarity, uint32_t AssertionTime, uint32_t DeassertionTime ) )
    CMOCK_MOCK_METHOD( void, HAL_UARTEx_WakeupCallback, ( UART_HandleTypeDef * huart ) )
#if defined( USART_CR1_FIFOEN )
    CMOCK_MOCK_METHOD( void, HAL_UARTEx_RxFifoFullCallback, ( UART_HandleTypeDef * huart ) )
    CMOCK_MOCK_METHOD( void, HAL_UARTEx_TxFifoEmptyCallback, ( UART_HandleTypeDef * huart ) )
#endif /* USART_CR1_FIFOEN */
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_StopModeWakeUpSourceConfig, ( UART_HandleTypeDef * huart, UART_WakeUpTypeDef WakeUpSelection ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_EnableStopMode, ( UART_HandleTypeDef * huart ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_DisableStopMode, ( UART_HandleTypeDef * huart ) )
#if defined( USART_CR3_UCESM )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_EnableClockStopMode, ( UART_HandleTypeDef * huart ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_DisableClockStopMode, ( UART_HandleTypeDef * huart ) )
#endif /* USART_CR3_UCESM */
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_MultiProcessorEx_AddressLength_Set, ( UART_HandleTypeDef * huart, uint32_t AddressLength ) )
#if defined( USART_CR1_FIFOEN )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_EnableFifoMode, ( UART_HandleTypeDef * huart ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_DisableFifoMode, ( UART_HandleTypeDef * huart ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_SetTxFifoThreshold, ( UART_HandleTypeDef * huart, uint32_t Threshold ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_SetRxFifoThreshold, ( UART_HandleTypeDef * huart, uint32_t Threshold ) )
#endif /* USART_CR1_FIFOEN */
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_ReceiveToIdle,
                       ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size, uint16_t *RxLen, uint32_t Timeout ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_ReceiveToIdle_IT, ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_UARTEx_ReceiveToIdle_DMA, ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size ) )

    // WWDG
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_WWDG_Init, ( WWDG_HandleTypeDef * hwwdg ) )
    CMOCK_MOCK_METHOD( HAL_StatusTypeDef, HAL_WWDG_Refresh, ( WWDG_HandleTypeDef * hwwdg ) )
};
